Import packages

In [10]:
import pandas as pd
import requests
import snowflake.connector as snow
from config import user, password, account, warehouse, database
from snowflake.connector.pandas_tools import write_pandas
import json
import xml.etree.ElementTree as ET

Connect to Snow
flake

In [5]:
# connect to snowflake
conn = snow.connect(
user='HUMBERTOD',
password='Danielaindarte11',
account='JQBVMSD-EV26583',
warehouse='COMPUTE_WH',
database='TEST',
)

In [7]:
cur = conn.cursor()
print("Successfully connected to Snowflake.")

Successfully connected to Snowflake.

In [8]:
# Step 1: Create schema ETL_ASSIGNEMENT_Q1 under TEST database
cur.execute("CREATE SCHEMA IF NOT EXISTS TEST.ETL_ASSIGNEMENT_Q1")
print("Schema TEST.ETL_ASSIGNEMENT_Q1 created or already exists.")

Schema TEST.ETL_ASSIGNEMENT_Q1 created or already exists.

Reading the distinct file formtas

In [17]:
# Read CSV file
csv_data = pd.read_csv('/Users/eleazar/Documents/Projects/DAMDS/day2/Question1/employees.csv')
csv_data.head()

   id           name department  salary
0   1  Alice Johnson    Finance   50091
1   2  Alice Johnson         IT   57010
2   3  Alice Johnson    Finance   78148

In [18]:
# Read JSON file
with open('/Users/eleazar/Documents/Projects/DAMDS/day2/Question1/employees.json', 'r') as f:
    json_data = json.load(f)
json_df = pd.DataFrame(json_data)
json_df.head()

   id      name department  salary
0   1  C Ronald    Finance   22091
1   2   trump D         IT   87010
2   3   Biden J    Finance   99148

In [19]:
# Read XML file
tree = ET.parse('/Users/eleazar/Documents/Projects/DAMDS/day2/Question1/employees.xml')
root = tree.getroot()
xml_data = []
for employee in root.findall('employee'):
    xml_data.append({
        'id': int(employee.find('id').text),
        'name': employee.find('name').text,
        'department': employee.find('department').text,
        'salary': int(employee.find('salary').text)
    })
xml_df = pd.DataFrame(xml_data)
xml_df.head()

   id            name department  salary
0   1      Alice Kent    Finance   60000
1   2  Victor Johnson         IT   66010
2   3       J Johnson    Finance   11148